cfe llm/Catalogs/AI_ПрофилиДоступаКДанным.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_ПрофилиДоступаКДанным</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьВыполнениеЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумШагов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумЗапросовКДанным</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумСтрокРезультата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлинаЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребоватьПериод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграниченныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_ПрофилиДоступаКДанным/Forms/ПодборМетаданных/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Режим = "Объекты";
	ЗначениеРежима = Неопределено;
	Если Параметры.Свойство("Режим", ЗначениеРежима)
			И ЗначениеЗаполнено(ЗначениеРежима) Тогда
		Режим = Строка(ЗначениеРежима);
	КонецЕсли;

	ПереданныеОбъекты = Неопределено;
	Если Параметры.Свойство("РазрешенныеОбъекты", ПереданныеОбъекты)
			И ПереданныеОбъекты <> Неопределено Тогда
		ТаблицаРазрешенных = РеквизитФормыВЗначение("РазрешенныеОбъекты");
		ТаблицаРазрешенных.Очистить();
		Для Каждого ПолноеИмя Из ПереданныеОбъекты Цикл
			Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТаблицаРазрешенных.Добавить();
			НоваяСтрока.ПолноеИмя = Строка(ПолноеИмя);
		КонецЦикла;
		ЗначениеВРеквизитФормы(ТаблицаРазрешенных, "РазрешенныеОбъекты");
	КонецЕсли;

	РежимПолей = НРег(Режим) = "поля";
	Заголовок = ?(РежимПолей, "Подбор ограниченных полей", "Подбор объектов метаданных");
	Элементы.ДанныеПодбораИмяПоля.Видимость = РежимПолей;
	Элементы.ДанныеПодбораТребоватьПериод.Видимость = Не РежимПолей;

	ОбновитьДанныеПодбораНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтрокаПоискаЗавершениеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)

	СтрокаПоиска = Текст;
	ОбновитьДанныеПодбораНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПоиск(Команда)

	ОбновитьДанныеПодбораНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)

	Для Каждого СтрокаПодбора Из ДанныеПодбора Цикл
		СтрокаПодбора.Выбрано = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)

	Для Каждого СтрокаПодбора Из ДанныеПодбора Цикл
		СтрокаПодбора.Выбрано = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыбранное(Команда)

	ВыбранныеЗначения = Новый Массив;
	РежимПолей = НРег(Режим) = "поля";
	Для Каждого СтрокаПодбора Из ДанныеПодбора Цикл
		Если Не СтрокаПодбора.Выбрано Тогда
			Продолжить;
		КонецЕсли;
		Если РежимПолей Тогда
			ВыбранныеЗначения.Добавить(Новый Структура(
				"ПолноеИмяОбъекта,ИмяПоля",
				СтрокаПодбора.ПолноеИмяОбъекта,
				СтрокаПодбора.ИмяПоля));
		Иначе
			ВыбранныеЗначения.Добавить(Новый Структура(
				"ПолноеИмяОбъекта,ТребоватьПериод",
				СтрокаПодбора.ПолноеИмяОбъекта,
				СтрокаПодбора.ТребоватьПериод));
		КонецЕсли;
	КонецЦикла;

	Если ВыбранныеЗначения.Количество() = 0 Тогда
		Сообщить("Отметьте хотя бы одну строку.");
		Возврат;
	КонецЕсли;

	Закрыть(ВыбранныеЗначения);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеПодбораНаСервере()

	ТаблицаПодбора = РеквизитФормыВЗначение("ДанныеПодбора");
	ТаблицаПодбора.Очистить();

	Если НРег(Режим) = "поля" Тогда
		ЗаполнитьПоля(ТаблицаПодбора);
	Иначе
		ЗаполнитьОбъекты(ТаблицаПодбора);
	КонецЕсли;

	ЗначениеВРеквизитФормы(ТаблицаПодбора, "ДанныеПодбора");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъекты(ТаблицаПодбора)

	РезультатПоиска = AI_МетаданныеСервер.НайтиОбъекты(СтрокаПоиска, Новый Массив, 100);
	Если Не РезультатПоиска.ok Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ОписаниеОбъекта Из РезультатПоиска.items Цикл
		НоваяСтрока = ТаблицаПодбора.Добавить();
		НоваяСтрока.Выбрано = Ложь;
		НоваяСтрока.ПолноеИмяОбъекта = ОписаниеОбъекта.full_name;
		НоваяСтрока.Представление = ?(
			ЗначениеЗаполнено(ОписаниеОбъекта.synonym),
			ОписаниеОбъекта.synonym,
			ОписаниеОбъекта.name);
		НоваяСтрока.Вид = ОписаниеОбъекта.kind;
		НоваяСтрока.ТребоватьПериод = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоля(ТаблицаПодбора)

	ТаблицаРазрешенных = РеквизитФормыВЗначение("РазрешенныеОбъекты");
	Для Каждого РазрешенныйОбъект Из ТаблицаРазрешенных Цикл
		ПолныеИмена = Новый Массив;
		ПолныеИмена.Добавить(РазрешенныйОбъект.ПолноеИмя);
		РезультатОписания = AI_МетаданныеСервер.Описать(ПолныеИмена);
		Если Не РезультатОписания.ok Тогда
			Продолжить;
		КонецЕсли;

		Для Каждого ОписаниеОбъекта Из РезультатОписания.items Цикл
			ТекстОшибки = Неопределено;
			Если ОписаниеОбъекта.Свойство("error", ТекстОшибки) Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьОбычныеПоля(ТаблицаПодбора, ОписаниеОбъекта);
			ДобавитьПоляТабличныхЧастей(ТаблицаПодбора, ОписаниеОбъекта);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьОбычныеПоля(ТаблицаПодбора, ОписаниеОбъекта)

	Для Каждого ОписаниеПоля Из ОписаниеОбъекта.fields Цикл
		ДобавитьПолеВПодбор(
			ТаблицаПодбора,
			ОписаниеОбъекта.full_name,
			ОписаниеПоля.name,
			ОписаниеПоля.synonym,
			ОписаниеПоля.kind,
			ОписаниеПоля.type);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляТабличныхЧастей(ТаблицаПодбора, ОписаниеОбъекта)

	Для Каждого ТабличнаяЧасть Из ОписаниеОбъекта.tabular_sections Цикл
		Для Каждого ОписаниеПоля Из ТабличнаяЧасть.fields Цикл
			ИмяПоля = ТабличнаяЧасть.name + "." + ОписаниеПоля.name;
			СинонимПоля = СокрЛП(ТабличнаяЧасть.synonym + " " + ОписаниеПоля.synonym);
			ДобавитьПолеВПодбор(
				ТаблицаПодбора,
				ОписаниеОбъекта.full_name,
				ИмяПоля,
				СинонимПоля,
				"tabular_section",
				ОписаниеПоля.type);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеВПодбор(ТаблицаПодбора, ПолноеИмяОбъекта, ИмяПоля, СинонимПоля, ВидПоля, ТипПоля)

	СтрокаСопоставления = НРег(
		ПолноеИмяОбъекта + " "
		+ ИмяПоля + " "
		+ СинонимПоля + " "
		+ ВидПоля + " "
		+ ТипПоля);
	Если ЗначениеЗаполнено(СтрокаПоиска)
			И СтрНайти(СтрокаСопоставления, НРег(СокрЛП(СтрокаПоиска))) = 0 Тогда
		Возврат;
	КонецЕсли;

	НоваяСтрока = ТаблицаПодбора.Добавить();
	НоваяСтрока.Выбрано = Ложь;
	НоваяСтрока.ПолноеИмяОбъекта = ПолноеИмяОбъекта;
	НоваяСтрока.ИмяПоля = ИмяПоля;
	НоваяСтрока.Представление = ?(ЗначениеЗаполнено(СинонимПоля), СинонимПоля, ИмяПоля);
	НоваяСтрока.Вид = ВидПоля;
	НоваяСтрока.ТребоватьПериод = Ложь;

КонецПроцедуры

#КонецОбласти
